app/controllers/todos_controller.rb

  def index
    @todos = Todo.where(email: session[:current_email])
---
SELECT "todos".* FROM "todos" WHERE "todos"."email" = ?  [["email", "someone_email@gmail.com"]]

  def create
    new_todo = Todo.new(permitted_params.merge(email: session[:current_email]))
    new_todo.save
---
INSERT INTO "todos" ("title", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?)  [["title", "Wash the cat."], ["created_at", 2017-02-26 13:12:30 UTC], ["updated_at", 2017-02-26 13:12:30 UTC], ["email", "person@example.com"]]